// Default config file for Horizon Exchange. This file is bundled in the exchange api jar file.
// To run the exchange svr with different values, copy this to /etc/horizon/exchange/config.json.
// In your version of the config file, you only have to set what you want to override.
{
	"api": {
		"limits": {
			"maxNodes": 1000,		// maximum number of nodes 1 user is allowed to create, 0 for unlimited
			"maxAgbots": 1000,		// maximum number of agbots 1 user is allowed to create, 0 for unlimited
			"maxAgreements": 1000,	// maximum number of agreements 1 node or agbot is allowed to create, 0 for unlimited
			"maxMessagesInMailbox": 500,	// maximum number of msgs currently in 1 node or agbot mailbox (the sending side is handled by rate limiting), 0 for unlimited
			"maxServices": 100,		// maximum number of services 1 user is allowed to create, 0 for unlimited
			"maxPatterns": 100		// maximum number of patterns 1 user is allowed to create, 0 for unlimited
		},
		"db": {
			"driverClass": "org.postgresql.Driver",
			"jdbcUrl": "jdbc:postgresql://sl-us-dal-9-portal.2.dblayer.com:10869/compose",		// the back-end db the exchange uses
			"user": "admin",
			"password": "",			// set this in your own version of this config file
			"minPoolSize": 1,
			"acquireIncrement": 1,
			"maxPoolSize": 50
		},
		"smtp": {		// set all of these in your own version of this config file
			"host": "",		// the SMTP relay svr the exchange uses to send reset pw emails
			"user": "",
			"password": ""
		},
		"logging": {
			"level": ""		// default level is INFO. For possible values, see http://logback.qos.ch/apidocs/ch/qos/logback/classic/Level.html
		},
		"root": {
			"password": "",			// set this in your own version of this config file
			"email": "",
			"frontEndHeader": ""     // Warning: only set this to a non-blank value when you have a front end (e.g. haproxy, data power, etc.) protecting the exchange that authenticates and authorizes all clients. If this is the case, set this value to a header field name the front end will set (but not let the client set and pass thru). This will give root privilege to the operation.
		}
	}
}
